IDEA Open Model
PretensionedTendonGroupItem Class
Compatible with IDEA StatiCa Beta 20.0
 The pretensionede tendon group item
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Tendon
 IdeaRS.OpenModel.Model.PretensionedTendonGroupItem
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class PretensionedTendonGroupItem : Tendon
Public Class PretensionedTendonGroupItem
	Inherits Tendon
The PretensionedTendonGroupItem type exposes the following members.
Constructors
Name | Description
PretensionedTendonGroupItem
Initializes a new instance of the PretensionedTendonGroupItem class
Top
Properties
Name | Description
Geometry
 Geometry
Id
 Element Id
 (Inherited from OpenElementId.)
Material
 Material
 (Inherited from Tendon.)
NumberOfStrand
 Number of strands
 (Inherited from Tendon.)
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace